Merge pull request #12 from datarocks-ag/feature/http2-support
Add support for keystore p12 for cert, http2
